In [27]:
import pandas as pd
import numpy as np

In [12]:
df = pd.read_csv('ex1.csv')

In [13]:
df

           !cat examples/ex1.csv
a b  c  d                message
1 2  3  4                  hello
5 6  7  8                  world
9 10 11 12                   foo

In [9]:
conda install pandas-datareader

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [15]:
import pandas_datareader.data as web
pd.read_table('ex1.csv', sep=',')

           !cat examples/ex1.csv
a b  c  d                message
1 2  3  4                  hello
5 6  7  8                  world
9 10 11 12                   foo

In [29]:
pd.read_csv('ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [31]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
names=['a', 'b', 'c', 'd', 'message']

In [33]:
pd.read_csv('ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [35]:
parsed=pd.read_csv('csv_mindex.csv', index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [42]:
list(open('ex3.txt'))

["['\t A\t    B \t      C\\n',\n",
 "'aaa -0.264438 -1.026059 -0.619500\\n',\n",
 "'bbb 0.927272 0.302904 -0.032399\\n',\n",
 "'ccc -0.264273 -0.386314 -0.217601\\n',\n",
 "'ddd -0.871858 -0.348382 1.100491\\n']\n"]

In [43]:
result=pd.read_table('ex3.txt', sep='\s+')
result

     ['         A         B          C\n',
0  'aaa -0.264438 -1.026059  -0.619500\n',
1  'bbb  0.927272  0.302904  -0.032399\n',
2  'ccc -0.264273 -0.386314  -0.217601\n',
3  'ddd -0.871858 -0.348382   1.100491\n']

In [44]:
pd.read_csv('ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [45]:
result= pd.read_csv('ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [46]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [49]:
result= pd.read_csv('ex5.csv', na_values = ['Null'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [50]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [52]:
pd.read_csv('ex5.csv', na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [53]:
data =pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [54]:
data.to_csv('out.csv')

In [55]:
import sys
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [56]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [57]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [58]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [61]:
import csv
f = open('ex7.csv')

In [62]:
reader = csv.reader(f)

In [63]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [64]:
with open('ex7.csv') as f:
    lines= list(csv.reader(f))

In [65]:
header, values = lines[0], lines[1:]

In [66]:
 data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [68]:
with open('mydata.csv', 'w') as f:
 writer = csv.writer(f, dialect=my_dialect)
 writer.writerow(('one', 'two', 'three'))
 writer.writerow(('1', '2', '3'))
 writer.writerow(('4', '5', '6'))
 writer.writerow(('7', '8', '9'))

In [69]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38,
 "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [72]:
import json
result =json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [73]:
 asjson = json.dumps(result)

In [74]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38